v1.0/diagrams/dpv-location.dot
#Location & Jurisdiction

digraph G {

rankdir=LR;
node [shape=rect,style=filled,fillcolor=yellow];
Thing [fillcolor=none];


Thing -> Law [label="hasApplicableLaw"];
Thing -> Country [label="hasCountry"];
Thing -> ThirdCountry [label="hasThirdCountry"];
Thing -> Location [label="hasLocation\nhasJurisdiction"];
ThirdCountry -> Country [arrowhead=onormal];
Location -> Country [dir=both, arrowhead=none, arrowtail=onormal];

}
